In [1]:
import pandas as pd
import numpy as np

### Household debt

In [2]:
house_debt = pd.read_csv("data/korea/hausehold_debt.csv")

house_debt.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME      Value  Flag Codes
0      AUS    HHDEBT     TOT  PC_NDI         A  1995   94.86145         NaN
1      AUS    HHDEBT     TOT  PC_NDI         A  1996   98.62147         NaN
2      AUS    HHDEBT     TOT  PC_NDI         A  1997  106.62240         NaN
3      AUS    HHDEBT     TOT  PC_NDI         A  1998  114.09520         NaN
4      AUS    HHDEBT     TOT  PC_NDI         A  1999  120.42900         NaN

In [3]:
house_debt.isna().sum()

LOCATION        0
INDICATOR       0
SUBJECT         0
MEASURE         0
FREQUENCY       0
TIME            0
Value           0
Flag Codes    732
dtype: int64

In [4]:
#check how many locations

house_debt["LOCATION"].value_counts()

DNK    24
AUT    24
POL    24
JPN    24
SVN    24
GBR    24
SVK    24
CAN    24
GRC    24
LVA    24
BEL    24
EST    24
FRA    24
USA    24
PRT    24
NOR    24
LTU    24
CZE    24
AUS    24
HUN    24
DEU    24
ITA    24
NLD    24
FIN    24
ESP    24
SWE    24
CHE    20
LUX    20
IRL    18
CHL    15
NZL    11
KOR     9
BRA     7
RUS     4
COL     4
Name: LOCATION, dtype: int64

In [5]:
# check if equal time for all locations

house_debt["TIME"].value_counts()

2015    35
2016    34
2014    34
2017    34
2013    33
2012    33
2011    33
2010    33
2009    32
2018    31
2008    31
2007    31
2004    30
2003    30
2006    30
2005    30
2002    29
2001    29
2000    28
1999    28
1998    26
1997    26
1996    26
1995    26
Name: TIME, dtype: int64

In [6]:
house_debt["INDICATOR"].value_counts()

HHDEBT    732
Name: INDICATOR, dtype: int64

In [7]:
house_debt["SUBJECT"].value_counts()

TOT    732
Name: SUBJECT, dtype: int64

In [8]:
house_debt["MEASURE"].value_counts()

PC_NDI    732
Name: MEASURE, dtype: int64

In [9]:
house_debt["FREQUENCY"].value_counts()

A    732
Name: FREQUENCY, dtype: int64

In [10]:
# drop columns 	INDICATOR	SUBJECT	MEASURE	FREQUENCY flag codes

house_debt = house_debt.drop(columns = ["Flag Codes", "INDICATOR", "SUBJECT", "MEASURE", "FREQUENCY"])

In [11]:
# rename columns LOCATION	TIME	Value

house_debt = house_debt.rename(columns = {"LOCATION" : "country", "TIME" : "year", "Value" : "household debt"})

### Household spending

In [12]:
house_spending = pd.read_csv("data/korea/haushold_spending.csv")

house_spending

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,AUS,HHEXP,TOT,MLN_USD,A,1960,14526.0841,NaN
1,AUS,HHEXP,TOT,MLN_USD,A,1961,14964.5525,NaN
2,AUS,HHEXP,TOT,MLN_USD,A,1962,16296.7539,NaN
3,AUS,HHEXP,TOT,MLN_USD,A,1963,17437.5301,NaN
4,AUS,HHEXP,TOT,MLN_USD,A,1964,18637.7800,NaN
...,...,...,...,...,...,...,...,...
8409,ZMB,HHEXP,TOT,MLN_USD,A,2012,25715.2984,NaN
8410,ZMB,HHEXP,TOT,MLN_USD,A,2013,27207.4129,NaN
8411,ZMB,HHEXP,TOT,MLN_USD,A,2014,29183.2200,NaN
8412,ZMB,HHEXP,TOT,MLN_USD,A,2015,29721.2614,NaN
8413,ZMB,HHEXP,TOT,MLN_USD,A,2016,31786.3475,NaN

In [13]:
house_spending.isna().sum()

LOCATION         0
INDICATOR        0
SUBJECT          0
MEASURE          0
FREQUENCY        0
TIME             0
Value            0
Flag Codes    5842
dtype: int64

In [14]:
house_spending["LOCATION"].value_counts()

AUS     255
FRA     251
USA     243
NOR     240
CAN     235
       ...
MKD      18
ARG      15
ZMB      11
PER       8
OECD      4
Name: LOCATION, Length: 61, dtype: int64

In [15]:
# house_spending["TIME"].value_counts()

In [16]:
house_spending = house_spending.drop(columns = ["Flag Codes", "INDICATOR", "SUBJECT", "MEASURE", "FREQUENCY"])

In [17]:
house_spending = house_spending.rename(columns = {"LOCATION" : "country", "TIME" : "year", "Value" : "household spent"})

In [18]:
house_spending.head()

  country  year  household spent
0     AUS  1960       14526.0841
1     AUS  1961       14964.5525
2     AUS  1962       16296.7539
3     AUS  1963       17437.5301
4     AUS  1964       18637.7800

### Poverty rate

In [19]:
poverty = pd.read_csv("data/korea/poverty_rate.csv")

poverty.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME  Value Flag Codes
0      AUS   POVERTY    0_17      RT         A  2012  0.129        NaN
1      AUS   POVERTY    0_17      RT         A  2014  0.130        NaN
2      AUS   POVERTY    0_17      RT         A  2016  0.125        NaN
3      AUS   POVERTY    0_17      RT         A  2018  0.133        NaN
4      AUS   POVERTY     TOT      RT         A  2012  0.140        NaN

In [20]:
poverty.isna().sum()

LOCATION         0
INDICATOR        0
SUBJECT          0
MEASURE          0
FREQUENCY        0
TIME             0
Value            0
Flag Codes    1708
dtype: int64

In [21]:
# poverty["LOCATION"].value_counts()

In [22]:
# in this case subject contain the age group (0_17 / 18_65 / 66MORE / TOT: Total)
# decided to keep the age group, but change the values and column name.

poverty["SUBJECT"].value_counts()

66MORE    430
18_65     430
TOT       430
0_17      430
Name: SUBJECT, dtype: int64

In [23]:
poverty["SUBJECT"] = poverty["SUBJECT"].replace({"0_17": "0-17", "18_65" : "18-65", "66MORE" : "66+", "TOT": "total"})

In [24]:
poverty["INDICATOR"].value_counts()

POVERTY    1720
Name: INDICATOR, dtype: int64

In [25]:
poverty["MEASURE"].value_counts()

RT    1720
Name: MEASURE, dtype: int64

In [26]:
poverty["FREQUENCY"].value_counts()

A    1720
Name: FREQUENCY, dtype: int64

In [27]:
poverty = poverty.drop(columns = ["Flag Codes", "INDICATOR", "MEASURE", "FREQUENCY"])

In [28]:
poverty.head()

  LOCATION SUBJECT  TIME  Value
0      AUS    0-17  2012  0.129
1      AUS    0-17  2014  0.130
2      AUS    0-17  2016  0.125
3      AUS    0-17  2018  0.133
4      AUS   total  2012  0.140

In [29]:
poverty = poverty.rename(columns = {"LOCATION" : "country", "TIME" : "year", "Value" : "poverty rate", "SUBJECT": "age group"})

### Internet access


Percentages of households who has internet access

In [30]:
int_access = pd.read_csv("data/korea/internet_access.csv")

In [31]:
int_access.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME    Value Flag Codes
0      BEL  INTERNET     TOT   PC_HH         A  2005  50.1575        NaN
1      BEL  INTERNET     TOT   PC_HH         A  2006  53.9597        NaN
2      BEL  INTERNET     TOT   PC_HH         A  2007  60.1640        NaN
3      BEL  INTERNET     TOT   PC_HH         A  2008  63.6276        NaN
4      BEL  INTERNET     TOT   PC_HH         A  2009  67.4352        NaN

In [32]:
# int_access["LOCATION"].value_counts()

In [33]:
int_access.isna().sum()

LOCATION        0
INDICATOR       0
SUBJECT         0
MEASURE         0
FREQUENCY       0
TIME            0
Value           0
Flag Codes    456
dtype: int64

In [34]:
int_access["INDICATOR"].value_counts()

INTERNET    476
Name: INDICATOR, dtype: int64

In [35]:
int_access["SUBJECT"].value_counts()

TOT    476
Name: SUBJECT, dtype: int64

In [36]:
int_access["MEASURE"].value_counts()

PC_HH    476
Name: MEASURE, dtype: int64

In [37]:
int_access["FREQUENCY"].value_counts()

A    476
Name: FREQUENCY, dtype: int64

In [38]:
int_access = int_access.drop(columns = ["INDICATOR", "SUBJECT", "MEASURE", "FREQUENCY", "Flag Codes"])

In [39]:
int_access = int_access.rename(columns = {"LOCATION" : "country", "TIME" : "year", "Value" : "internet access"})

### Labour compensation per hour

In [40]:
lab_hour = pd.read_csv("data/korea/labour_compensation_per_hour.csv")

lab_hour.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME     Value  Flag Codes
0      AUS   LABCOMP     TOT  AGRWTH         A  1986  5.168118         NaN
1      AUS   LABCOMP     TOT  AGRWTH         A  1987  5.915590         NaN
2      AUS   LABCOMP     TOT  AGRWTH         A  1988  7.255069         NaN
3      AUS   LABCOMP     TOT  AGRWTH         A  1989  5.978699         NaN
4      AUS   LABCOMP     TOT  AGRWTH         A  1990  6.079849         NaN

In [41]:
# lab_hour["LOCATION"].value_counts()

In [42]:
lab_hour["INDICATOR"].value_counts()

LABCOMP    2323
Name: INDICATOR, dtype: int64

In [43]:
lab_hour["SUBJECT"].value_counts()

TOT    2323
Name: SUBJECT, dtype: int64

In [44]:
lab_hour["MEASURE"].value_counts()

IDX2010    1183
AGRWTH     1140
Name: MEASURE, dtype: int64

In [45]:
lab_hour["FREQUENCY"].value_counts()

A    2323
Name: FREQUENCY, dtype: int64

In [46]:
lab_hour = lab_hour.drop(columns = ["INDICATOR", "SUBJECT", "MEASURE", "FREQUENCY", "Flag Codes"])

In [47]:
lab_hour = lab_hour.rename(columns = {"LOCATION" : "country", "TIME" : "year", "Value" : "labour comp per hour"})

### Unenployment Rate

In [48]:
unemp_rate = pd.read_csv("data/korea/unemployment_rate.csv")

unemp_rate.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME     Value Flag Codes
0      AUS     UNEMP     MEN   PC_LF         A  1979  5.162579        NaN
1      AUS     UNEMP     MEN   PC_LF         A  1980  5.068766        NaN
2      AUS     UNEMP     MEN   PC_LF         A  1981  4.808415        NaN
3      AUS     UNEMP     MEN   PC_LF         A  1982  6.345981        NaN
4      AUS     UNEMP     MEN   PC_LF         A  1983  9.716337        NaN

In [49]:
unemp_rate.isna().sum()

LOCATION          0
INDICATOR         0
SUBJECT           0
MEASURE           0
FREQUENCY         0
TIME              0
Value             0
Flag Codes    28995
dtype: int64

In [50]:
# unemp_rate["LOCATION"].value_counts()

In [51]:
unemp_rate["INDICATOR"].value_counts()

UNEMP    29501
Name: INDICATOR, dtype: int64

In [52]:
unemp_rate["SUBJECT"].value_counts()

TOT      10460
MEN       9525
WOMEN     9516
Name: SUBJECT, dtype: int64

In [53]:
unemp_rate["MEASURE"].value_counts()

PC_LF    29501
Name: MEASURE, dtype: int64

In [54]:
unemp_rate["FREQUENCY"].value_counts()

Q    13457
M    12614
A     3430
Name: FREQUENCY, dtype: int64

In [55]:
# droping extra rows for frequency and keeping just anual values

unemp_rate = unemp_rate.drop(unemp_rate[(unemp_rate.FREQUENCY == "M")].index)

unemp_rate = unemp_rate.drop(unemp_rate[unemp_rate.FREQUENCY == "Q"].index)
unemp_rate["FREQUENCY"].value_counts()

A    3430
Name: FREQUENCY, dtype: int64

In [56]:
#dropping extra rows for subject and keeping just total

unemp_rate = unemp_rate.drop(unemp_rate[(unemp_rate.SUBJECT == "MEN")].index)

unemp_rate = unemp_rate.drop(unemp_rate[unemp_rate.SUBJECT == "WOMEN"].index)

In [57]:
unemp_rate["SUBJECT"].value_counts()

TOT    1213
Name: SUBJECT, dtype: int64

In [58]:
unemp_rate = unemp_rate.drop(columns = ["INDICATOR", "SUBJECT", "MEASURE", "FREQUENCY", "Flag Codes"])

In [59]:
unemp_rate = unemp_rate.rename(columns = {"LOCATION" : "country", "TIME" : "year", "Value" : "unemployment rate"})

In [60]:
unemp_rate.reset_index(drop = True)

     country  year  unemployment rate
0        AUS  1967           1.875000
1        AUS  1968           1.850000
2        AUS  1969           1.800000
3        AUS  1970           1.625000
4        AUS  1971           1.925000
...      ...   ...                ...
1208     LTU  2015           9.119895
1209     LTU  2016           7.860914
1210     LTU  2017           7.071820
1211     LTU  2018           6.152077
1212     LTU  2019           6.255139

[1213 rows x 3 columns]

In [61]:
unemp_rate.dtypes

country               object
year                  object
unemployment rate    float64
dtype: object

In [62]:
unemp_rate["year"] = unemp_rate["year"].astype(int)

In [63]:
unemp_rate.dtypes

country               object
year                   int32
unemployment rate    float64
dtype: object

In [64]:
house_debt = house_debt.merge(lab_hour, how = 'left',  on = ["country", "year"]).reset_index(drop = True)

In [65]:
house_debt = house_debt.merge(poverty, how = 'left', on= ["country", "year"]).reset_index(drop = True)

In [66]:
house_debt.isna().sum()

country                   0
year                      0
household debt            0
labour comp per hour     69
age group               754
poverty rate            754
dtype: int64

In [67]:
house_debt = house_debt.merge(int_access, how = 'left', on= ["country", "year"]).reset_index(drop = True)

In [68]:
house_debt

,country,year,household debt,labour comp per hour,age group,poverty rate,internet access
0,AUS,1995,94.86145,5.638905,NaN,NaN,NaN
1,AUS,1995,94.86145,52.416612,NaN,NaN,NaN
2,AUS,1996,98.62147,6.317506,NaN,NaN,NaN
3,AUS,1996,98.62147,55.728035,NaN,NaN,NaN
4,AUS,1997,106.62240,2.936676,NaN,NaN,NaN
...,...,...,...,...,...,...,...
3385,NZL,2017,121.73190,120.139827,NaN,NaN,NaN
3386,COL,2015,43.98483,NaN,NaN,NaN,NaN
3387,COL,2016,46.05379,NaN,NaN,NaN,NaN
3388,COL,2017,46.40100,NaN,NaN,NaN,NaN
3389,COL,2018,47.16065,NaN,NaN,NaN,NaN

In [69]:
economic_info = house_debt.merge(unemp_rate, how = 'left', on= ["country", "year"]).reset_index(drop = True)

In [70]:
economic_info.isna().sum()

country                   0
year                      0
household debt            0
labour comp per hour     69
age group               754
poverty rate            754
internet access         951
unemployment rate       237
dtype: int64

In [71]:
len(economic_info)

3390

In [72]:
country_code = {'AFG': 'Afghanistan','ALA': 'Aland Islands','ALB': 'Albania','DZA': 'Algeria','ASM': 'American Samoa','AND': 'Andorra','AGO': 'Angola','AIA': 'Anguilla','ATA': 'Antarctica','ATG': 'Antigua and Barbuda','ARG': 'Argentina','ARM': 'Armenia','ABW': 'Aruba','AUS': 'Australia','AUT': 'Austria','AZE': 'Azerbaijan','BHS': 'Bahamas','BHR': 'Bahrain','BGD': 'Bangladesh','BRB': 'Barbados','BLR': 'Belarus','BEL': 'Belgium','BLZ': 'Belize','BEN': 'Benin','BMU': 'Bermuda','BTN': 'Bhutan','BOL': 'Bolivia','BES': 'Bonaire, Saint Eustatius and Saba ','BIH': 'Bosnia and Herzegovina','BWA': 'Botswana','BVT': 'Bouvet Island','BRA': 'Brazil','IOT': 'British Indian Ocean Territory','VGB': 'British Virgin Islands','BRN': 'Brunei','BGR': 'Bulgaria','BFA': 'Burkina Faso','BDI': 'Burundi','KHM': 'Cambodia','CMR': 'Cameroon','CAN': 'Canada','CPV': 'Cape Verde','CYM': 'Cayman Islands','CAF': 'Central African Republic','TCD': 'Chad','CHL': 'Chile','CHN': 'China','CXR': 'Christmas Island','CCK': 'Cocos Islands','COL': 'Colombia','COM': 'Comoros','COK': 'Cook Islands','CRI': 'Costa Rica','HRV': 'Croatia','CUB': 'Cuba','CUW': 'Curacao','CYP': 'Cyprus','CZE': 'Czech Republic','COD': 'Democratic Republic of the Congo','DNK': 'Denmark','DJI': 'Djibouti','DMA': 'Dominica','DOM': 'Dominican Republic','TLS': 'East Timor','ECU': 'Ecuador','EGY': 'Egypt','SLV': 'El Salvador','GNQ': 'Equatorial Guinea','ERI': 'Eritrea','EST': 'Estonia','ETH': 'Ethiopia','FLK': 'Falkland Islands','FRO': 'Faroe Islands','FJI': 'Fiji','FIN': 'Finland','FRA': 'France','GUF': 'French Guiana','PYF': 'French Polynesia','ATF': 'French Southern Territories','GAB': 'Gabon','GMB': 'Gambia','GEO': 'Georgia','DEU': 'Germany','GHA': 'Ghana','GIB': 'Gibraltar','GRC': 'Greece','GRL': 'Greenland','GRD': 'Grenada','GLP': 'Guadeloupe','GUM': 'Guam','GTM': 'Guatemala','GGY': 'Guernsey','GIN': 'Guinea','GNB': 'Guinea-Bissau','GUY': 'Guyana','HTI': 'Haiti','HMD': 'Heard Island and McDonald Islands','HND': 'Honduras','HKG': 'Hong Kong','HUN': 'Hungary','ISL': 'Iceland','IND': 'India','IDN': 'Indonesia','IRN': 'Iran','IRQ': 'Iraq','IRL': 'Ireland','IMN': 'Isle of Man','ISR': 'Israel','ITA': 'Italy','CIV': 'Ivory Coast','JAM': 'Jamaica','JPN': 'Japan','JEY': 'Jersey','JOR': 'Jordan','KAZ': 'Kazakhstan','KEN': 'Kenya','KIR': 'Kiribati','XKX': 'Kosovo','KWT': 'Kuwait','KGZ': 'Kyrgyzstan','LAO': 'Laos','LVA': 'Latvia','LBN': 'Lebanon','LSO': 'Lesotho','LBR': 'Liberia','LBY': 'Libya','LIE': 'Liechtenstein','LTU': 'Lithuania','LUX': 'Luxembourg','MAC': 'Macao','MKD': 'Macedonia','MDG': 'Madagascar','MWI': 'Malawi','MYS': 'Malaysia','MDV': 'Maldives','MLI': 'Mali','MLT': 'Malta','MHL': 'Marshall Islands','MTQ': 'Martinique','MRT': 'Mauritania','MUS': 'Mauritius','MYT': 'Mayotte','MEX': 'Mexico','FSM': 'Micronesia','MDA': 'Moldova','MCO': 'Monaco','MNG': 'Mongolia','MNE': 'Montenegro','MSR': 'Montserrat','MAR': 'Morocco','MOZ': 'Mozambique','MMR': 'Myanmar','NAM': 'Namibia','NRU': 'Nauru','NPL': 'Nepal','NLD': 'Netherlands','ANT': 'Netherlands Antilles','NCL': 'New Caledonia','NZL': 'New Zealand','NIC': 'Nicaragua','NER': 'Niger','NGA': 'Nigeria','NIU': 'Niue','NFK': 'Norfolk Island','PRK': 'North Korea','MNP': 'Northern Mariana Islands','NOR': 'Norway','OMN': 'Oman','PAK': 'Pakistan','PLW': 'Palau','PSE': 'Palestinian Territory','PAN': 'Panama','PNG': 'Papua New Guinea','PRY': 'Paraguay','PER': 'Peru','PHL': 'Philippines','PCN': 'Pitcairn','POL': 'Poland','PRT': 'Portugal','PRI': 'Puerto Rico','QAT': 'Qatar','COG': 'Republic of the Congo','REU': 'Reunion','ROU': 'Romania','RUS': 'Russia','RWA': 'Rwanda','BLM': 'Saint Barthelemy','SHN': 'Saint Helena','KNA': 'Saint Kitts and Nevis','LCA': 'Saint Lucia','MAF': 'Saint Martin','SPM': 'Saint Pierre and Miquelon','VCT': 'Saint Vincent and the Grenadines','WSM': 'Samoa','SMR': 'San Marino','STP': 'Sao Tome and Principe','SAU': 'Saudi Arabia','SEN': 'Senegal','SRB': 'Serbia','SCG': 'Serbia and Montenegro','SYC': 'Seychelles','SLE': 'Sierra Leone','SGP': 'Singapore','SXM': 'Sint Maarten','SVK': 'Slovakia','SVN': 'Slovenia','SLB': 'Solomon Islands','SOM': 'Somalia','ZAF': 'South Africa','SGS': 'South Georgia and the South Sandwich Islands','KOR': 'South Korea','SSD': 'South Sudan','ESP': 'Spain','LKA': 'Sri Lanka','SDN': 'Sudan','SUR': 'Suriname','SJM': 'Svalbard and Jan Mayen','SWZ': 'Swaziland','SWE': 'Sweden','CHE': 'Switzerland','SYR': 'Syria','TWN': 'Taiwan','TJK': 'Tajikistan','TZA': 'Tanzania','THA': 'Thailand','TGO': 'Togo','TKL': 'Tokelau','TON': 'Tonga','TTO': 'Trinidad and Tobago','TUN': 'Tunisia','TUR': 'Turkey','TKM': 'Turkmenistan','TCA': 'Turks and Caicos Islands','TUV': 'Tuvalu','VIR': 'U.S. Virgin Islands','UGA': 'Uganda','UKR': 'Ukraine','ARE': 'United Arab Emirates','GBR': 'United Kingdom','USA': 'United States','UMI': 'United States Minor Outlying Islands','URY': 'Uruguay','UZB': 'Uzbekistan','VUT': 'Vanuatu','VAT': 'Vatican','VEN': 'Venezuela','VNM': 'Vietnam','WLF': 'Wallis and Futuna','ESH': 'Western Sahara','YEM': 'Yemen','ZMB': 'Zambia','ZWE': 'Zimbabwe'}

In [73]:
#for country in economic_info["country"]:
#    if country in country_code:
#        economic_info["country"] = country

In [81]:
for i in range(len(economic_info)):
    economic_info.loc[i, "country"] = country_code[economic_info.loc[i, "country"]]

In [82]:
economic_info

,country,year,household debt,labour comp per hour,age group,poverty rate,internet access,unemployment rate
0,Australia,1995,94.86145,5.638905,NaN,NaN,NaN,8.472281
1,Australia,1995,94.86145,52.416612,NaN,NaN,NaN,8.472281
2,Australia,1996,98.62147,6.317506,NaN,NaN,NaN,8.506114
3,Australia,1996,98.62147,55.728035,NaN,NaN,NaN,8.506114
4,Australia,1997,106.62240,2.936676,NaN,NaN,NaN,8.362488
...,...,...,...,...,...,...,...,...
3385,New Zealand,2017,121.73190,120.139827,NaN,NaN,NaN,4.700000
3386,Colombia,2015,43.98483,NaN,NaN,NaN,NaN,8.960834
3387,Colombia,2016,46.05379,NaN,NaN,NaN,NaN,9.274167
3388,Colombia,2017,46.40100,NaN,NaN,NaN,NaN,9.425834
3389,Colombia,2018,47.16065,NaN,NaN,NaN,NaN,9.719167

In [83]:
economic_info.to_csv("data/economic_info.csv")